simple = [
    ("水素", "H"), ("ヘリウム", "He"), ("リチウム", "Li"), ("ベリリウム", "Be"), ("ホウ素", "B"), ("炭素", "C"), 
    ("窒素", "N"), ("酸素", "O"), ("フッ素", "F"), ("ネオン", "Ne"), ("ナトリウム", "Na"), ("マグネシウム", "Mg"), 
    ("アルミニウム", "Al"), ("ケイ素", "Si"), ("リン", "P"), ("硫黄", "S"), ("塩素", "Cl"), ("アルゴン", "Ar"), 
    ("カリウム", "K"), ("カルシウム", "Ca")
]

elements = [
    ("水素", "H"), ("ヘリウム", "He"), ("リチウム", "Li"), ("ベリリウム", "Be"), ("ホウ素", "B"), ("炭素", "C"), 
    ("窒素", "N"), ("酸素", "O"), ("フッ素", "F"), ("ネオン", "Ne"), ("ナトリウム", "Na"), ("マグネシウム", "Mg"), 
    ("アルミニウム", "Al"), ("ケイ素", "Si"), ("リン", "P"), ("硫黄", "S"), ("塩素", "Cl"), ("アルゴン", "Ar"), 
    ("カリウム", "K"), ("カルシウム", "Ca"), ("スカンジウム", "Sc"), ("チタン", "Ti"), ("バナジウム", "V"), 
    ("クロム", "Cr"), ("マンガン", "Mn"), ("鉄", "Fe"), ("コバルト", "Co"), ("ニッケル", "Ni"), ("銅", "Cu"), 
    ("亜鉛", "Zn"), ("ガリウム", "Ga"), ("ゲルマニウム", "Ge"), ("ヒ素", "As"), ("セレン", "Se"), ("臭素", "Br"), 
    ("クリプトン", "Kr")
]

elements = [
    ("水素", "H"), ("ヘリウム", "He"), ("リチウム", "Li"), ("ベリリウム", "Be"), ("ホウ素", "B"), ("炭素", "C"), 
    ("窒素", "N"), ("酸素", "O"), ("フッ素", "F"), ("ネオン", "Ne"), ("ナトリウム", "Na"), ("マグネシウム", "Mg"), 
    ("アルミニウム", "Al"), ("ケイ素", "Si"), ("リン", "P"), ("硫黄", "S"), ("塩素", "Cl"), ("アルゴン", "Ar"), 
    ("カリウム", "K"), ("カルシウム", "Ca"), ("スカンジウム", "Sc"), ("チタン", "Ti"), ("バナジウム", "V"), 
    ("クロム", "Cr"), ("マンガン", "Mn"), ("鉄", "Fe"), ("コバルト", "Co"), ("ニッケル", "Ni"), ("銅", "Cu"), 
    ("亜鉛", "Zn"), ("ガリウム", "Ga"), ("ゲルマニウム", "Ge"), ("ヒ素", "As"), ("セレン", "Se"), ("臭素", "Br"), 
    ("クリプトン", "Kr"), ("ルビジウム", "Rb"), ("ストロンチウム", "Sr"), ("銀", "Ag"), 
    ("アンチモン", "Sb"), ("ヨウ素", "I"), ("キセノン", "Xe"), ("セシウム", "Cs"), 
    ("バリウム", "Ba"),  ("白金", "Pt"), ("金", "Au"), ("水銀", "Hg"), 
    ("アスタチン", "At"), ("ラドン", "Rn"), ("フランシウム", "Fr"), ("ラジウム", "Ra")
]

elements = [
    ("水素", "H"), ("ヘリウム", "He"), ("リチウム", "Li"), ("ベリリウム", "Be"), ("ホウ素", "B"), ("炭素", "C"), 
    ("窒素", "N"), ("酸素", "O"), ("フッ素", "F"), ("ネオン", "Ne"), ("ナトリウム", "Na"), ("マグネシウム", "Mg"), 
    ("アルミニウム", "Al"), ("ケイ素", "Si"), ("リン", "P"), ("硫黄", "S"), ("塩素", "Cl"), ("アルゴン", "Ar"), 
    ("カリウム", "K"), ("カルシウム", "Ca"), ("スカンジウム", "Sc"), ("チタン", "Ti"), ("バナジウム", "V"), 
    ("クロム", "Cr"), ("マンガン", "Mn"), ("鉄", "Fe"), ("コバルト", "Co"), ("ニッケル", "Ni"), ("銅", "Cu"), 
    ("亜鉛", "Zn"), ("ガリウム", "Ga"), ("ゲルマニウム", "Ge"), ("ヒ素", "As"), ("セレン", "Se"), ("臭素", "Br"), 
    ("クリプトン", "Kr"), ("ルビジウム", "Rb"), ("ストロンチウム", "Sr"), ("イットリウム", "Y"), ("ジルコニウム", "Zr"), 
    ("ニオブ", "Nb"), ("モリブデン", "Mo"), ("テクネチウム", "Tc"), ("ルテニウム", "Ru"), ("ロジウム", "Rh"), 
    ("パラジウム", "Pd"), ("銀", "Ag"), ("カドミウム", "Cd"), ("インジウム", "In"), ("スズ", "Sn"), 
    ("アンチモン", "Sb"), ("テルル", "Te"), ("ヨウ素", "I"), ("キセノン", "Xe"), ("セシウム", "Cs"), 
    ("バリウム", "Ba"), ("ランタン", "La"), ("セリウム", "Ce"), ("プラセオジム", "Pr"), ("ネオジム", "Nd"), 
    ("プロメチウム", "Pm"), ("サマリウム", "Sm"), ("ユウロピウム", "Eu"), ("ガドリニウム", "Gd"), 
    ("テルビウム", "Tb"), ("ジスプロシウム", "Dy"), ("ホルミウム", "Ho"), ("エルビウム", "Er"), 
    ("ツリウム", "Tm"), ("イッテルビウム", "Yb"), ("ルテチウム", "Lu"), ("ハフニウム", "Hf"), ("タンタル", "Ta"), 
    ("タングステン", "W"), ("レニウム", "Re"), ("オスミウム", "Os"), ("イリジウム", "Ir"), ("白金", "Pt"), 
    ("金", "Au"), ("水銀", "Hg"), ("タリウム", "Tl"), ("鉛", "Pb"), ("ビスマス", "Bi"), ("ポロニウム", "Po"), 
    ("アスタチン", "At"), ("ラドン", "Rn"), ("フランシウム", "Fr"), ("ラジウム", "Ra"), ("アクチニウム", "Ac"), 
    ("トリウム", "Th"), ("プロトアクチニウム", "Pa"), ("ウラン", "U"), ("ネプツニウム", "Np"), ("プルトニウム", "Pu"), 
    ("アメリシウム", "Am"), ("キュリウム", "Cm"), ("バークリウム", "Bk"), ("カリホルニウム", "Cf"), 
    ("アインスタイニウム", "Es"), ("フェルミウム", "Fm"), ("メンデレビウム", "Md"), ("ノーベリウム", "No"), 
    ("ローレンシウム", "Lr"), ("ラザホージウム", "Rf"), ("ドブニウム", "Db"), ("シーボーギウム", "Sg"), 
    ("ボーリウム", "Bh"), ("ハッシウム", "Hs"), ("マイトネリウム", "Mt"), ("ダームスタチウム", "Ds"), 
    ("レントゲニウム", "Rg"), ("コペルニシウム", "Cn"), ("ニホニウム", "Nh"), ("フレロビウム", "Fl"), 
    ("モスコビウム", "Mc"), ("リバモリウム", "Lv"), ("テネシン", "Ts"), ("オガネソン", "Og")
]

print(len(elements))